var name1 = ["가난뱅이 신이!", "가면의 메이드가이", "가브릴 드롭아웃", "가사라키", "가시나무왕", "가이킹 LEGEND OF DAIKU-MARYU", "가정교사 히트맨 REBORN!", "간츠", "갈릴레이 돈나", "감바의 모험", "감옥학원", "갑충왕자 무시킹", "갑철성의 카바네리", "강각의 레기오스", "강식장갑 가이버", "강철삼국지", "강철의 라인배럴", "강철의 연금술사", "강철의 연금술사 FULLMETAL ALCHEMIST", "강철 지그", "강철신 지그", "강철천사 쿠루미", "강Q초아 잇키맨", "개골개골 마법사", "개구리 왕눈이", "개구리 중사 케로로", "개그만화 보기 좋은 날", "개와 가위는 쓰기 나름", "갤러리 페이크", "갤럭시 엔젤", "거꾸로 된 파테마", "거신 고그", "거인의 별", "건강 전라계 수영부 우미쇼", "건그레이브", "건담 시리즈", "건방진 천사", "건슬링거 걸", "건어물 여동생! 우마루짱", "건전로봇 다이미다라", "걸즈 브라보", "검풍전기 베르세르크", "겁쟁이 페달", "게게게의 키타로", "게드전기", "게이트 - 자위대. 그의 땅에서", "이처럼 싸우며", "게이트 키퍼즈", "겟 백커스", "겟타로보 시리즈", "결계사", "경계선상의 호라이즌", "경계의 린네", "경계의 저편", "경녀!!!!!!!!", "계란 프라이의 노른자는 언제 먹을까", "견습신 비밀의 코코타마", "고 녀석 맛나겠다", "고기동환상 건퍼레이드 마치", "고르고13", "고스트 스위퍼 (GS 미카미 극락대작전!)", "고스트 헌트", "고식(GOSICK)", "고양이 당인전 테얀데에", "고양이의 보은", "고쿠도 군 만유기", "고쿠죠 ~극락원여학교 기숙사 이야기~", "고키챠", "곤", "골든보이", "골든 타임", "골판지 전기 시리즈", "골프천재 탄도", "공각기동대", "공룡킹 어드벤쳐", "공상과학세계 걸리버보이", "공의 경계", "공중그네", "과학닌자대 갓챠맨", "관희 챠이카", "광란가족일기", "광속전신 알베가스", "괭이갈매기 울 적에", "괴담 레스토랑", "괴도 세인트 테일", "괴도 조커", "괴물군", "괴물왕녀", "괴물의 아이", "괴짜가족", "교향시편 에우레카 세븐", "에우레카 세븐 AO", "구구레 코쿠리상", "구름의 저편", "약속의 장소", "구름처럼 바람처럼", "구명전사 제노사이버", "구슬동자", "구인사가", "귀가부 활동 기록", "귀등의 섬", "귀부 시리즈", "그것이 성우!", "그날 본 꽃의 이름을 우리는 아직 모른다", "그 남자! 그 여자!", "그녀와 그녀의 고양이", "그녀와 그녀의 고양이 -Everything flows-", "그녀의 플래그가 꺾이면", "그대가 바라는 영원", "그라비테이션", "그로이저X", "그럼에도 세상은 아름답다", "그래도 마을은 돌아간다", "그래서 나는 H를 할 수 없다", "그레고리 호러쇼", "그래플러 바키", "그레너디어(만화)", "그레이트 마징가", "그리자이아의 과실", "그리자이아의 낙원", "그 여름에서 기다릴게", "극상생도회", "극흑의 브룬힐데", "근육맨", "근육맨2세", "금붕어 주의보", "금빛 모자이크", "금색의 갓슈", "금색의 코르다", "글라스립", "기갑계 가리안", "기갑전기 드라고나", "기갑창세기 모스피다", "기갑함대 다이라가XV", "기교기전 히오우전기", "기교소녀는 상처받지 않아", "기동경찰 패트레이버", "기동전사 건담씨", "기동전함 나데시코", "기동천사 엔젤릭 레이어", "기분 나쁜 모노노케안", "기생수 세이의 격률", "기수신세기 조이드", "기신대전 기간틱 포뮬러", "기신병단", "기신포후 데몬베인", "기어와라! 냐루코 양", "기어전사 덴도", "기프트", "길 잃은 고양이 오버런!", "길가메쉬", "길티 크라운", "김의 십자가", "꼬마마법사 레미", "꼬마자동차 붕붕", "꾀돌이 삼총사", "꽃이 피는 첫걸음", "꾸러기 수비대", "꿈의 사도", "꿈의 크레용 왕국", "꿈빛 파티시엘", "꿈별의 버튼노즈", "꿈을 먹는 메리", "나가토 유키짱의 소실", "나나", "나나와 카오루", "나나카 6/17", "나는 친구가 적다", "나루타루", "나루토", "나만이 없는 거리", "나이트 위저드", "나의 히어로 아카데미아", "나지카 전격작전", "나츠메 우인장", "낙원추방", "낙제 기사의 영웅담", "낚시왕 강바다", "난다 난다 니얀다", "난바카", "날아라 호빵맨", "남자 고교생의 일상", "냥파이어", "냥코로리 ~켄프로 학원~", "내가 아가씨 학교에 ‘서민 샘플’로 납치당한 사건", "내가 인기 없는 건 아무리 생각해도 너희들 탓이야!", "내 뇌 속의 선택지가 학원 러브 코미디를 전력으로 방해하고 있다", "내 여동생이 이렇게 귀여울 리가 없어", "내 여자친구와 소꿉친구가 완전 수라장", "내 이야기!!", "내일의 나쟈", "내일의 요이치", "내일의 죠", "너스위치 코무기짱 매지카르테", "너에게 닿기를", "너의 이름은.", "네기마!?", "네오 안젤리크 Abyss", "네코모노가타리 (흑)", "노 게임 노 라이프", "노기자카 하루카의 비밀", "노다메 칸타빌레", "노라가미", "노래의☆왕자님♪", "노부나가 더 풀", "노부나가 콘체르토", "노블레스", "노에인 ~또 하나의 너에게~", "노을빛으로 물드는 언덕", "논논비요리", "녹색나라 삐삐의 모험", "농림", "누나 로그", "누라리횬의 손자", "눈의 여왕", "느와르", "늑대아이", "늑대와 향신료", "늑대소녀와 흑왕자", "니노미야 군에게 애도를", "니닌가 시노부전", "니들리스", "니세코이", "니세모노가타리", "니아 언더 세븐", "닌자무예장", "닌자보이 란타로", "닌자의 왕", "닌자전사 토비카게", "닐스의 모험", "다!다!다!", "다가시카시", "다다미 넉 장 반 세계일주", "다이쇼 야구 소녀", "다카포 시리즈", "닥터 슬럼프", "단간론파 -희망의 학교와 절망의 고교생- The Animation", "단간론파 3 -The End of 키보가미네 학원-", "단재분리의 크라임엣지", "단칸방의 침략자!?", "단탈리안의 서가", "달려라 부메랑", "달로스", "달은 동쪽으로 해는 서쪽으로", "달의 요정 세일러문", "달콤달콤 & 짜릿짜릿", "달타냥의 모험", "대공마룡 가이킹", "대도서관의 양치기", "대마법고개", "대운동회", "댄스 위드 데빌즈", "댄스 인 더 뱀파이어 번드", "던전에서 만남을 추구하면 안 되는 걸까", "데미는 이야기하고 싶어", "데스노트", "데이트 어 라이브", "도그 데이즈", "도라에몽", "도련님의 시대", "도로롱 엔마군 활활", "도박묵시록 카이지", "도서관전쟁", "도시락 전쟁", "도쿄 갓파더즈", "도쿄 구울", "도쿄 레이븐스", "도쿄 마블 초콜릿", "도쿄 매그니튜드 8.0", "도쿄 바빌론", "도쿄 언더그라운드", "도쿄ESP", "도쿄NECRO", "도키메키 메모리얼", "도화월탄", "독수리 오형제", "돈카츠 DJ 아게타로", "돌격! 빳빠라대", "돌격 크로마티 고교", "돌아가는 펭귄드럼", "돗키리 닥터", "동급생2 OVA", "동쪽의 에덴", "동창회", "동화총사 아카즈킨", "되살아나는 하늘 -RESCUE WINGS-", "두근두근 비밀친구", "두근두근! 프리큐어", "두 사람은 프리큐어", "두 사람은 프리큐어 Splash Star", "듀라라라!!", "듀얼! 패러렐룬룬 이야기", "드래고너트 -더 레조넌스-", "드래곤 드라이브", "드래곤 드림", "드래곤 리그", "드래곤볼", "드래곤 크라이시스", "드래곤 키드", "드루아가의 탑", "드리프터즈", "들장미 소녀 제니", "들장미 소녀 캔디", "디멘션 W", "디어보이스", "디어 브라더", "디 엔 엔젤", "디지몬 시리즈", "디지캐럿", "디트로이트 메탈 시티", "디-프래그!", "따끈따끈 베이커리", "딸기 마시마로", "떴다! 럭키맨", "디아볼릭 러버즈", "라무네", "라 세느의 별", "라스트 엑자일", "라스트 엑자일 은빛 날개의 팜", "라이브 온 카드리버", "라임색 전기담", "라제폰", "랜스 & 마스크", "란마 1/2", "란포 기담 Game of Laplace", "러브라보", "러브 라이브!", "러브 라이브! 선샤인!!", "러브히나", "러키☆스타", "레갈리아 The Three Sacred Stars", "레드라인(애니메이션)", "레벨 E", "레이디버그[1]", "레이디X버틀러!", "레이브(만화)", "렌탈 마법사", "로그 호라이즌", "로도스도 전기", "로미오X줄리엣", "로봇 걸즈 Z", "로봇수사대 K캅스", "로스트 유니버스", "로자리오와 뱀파이어", "로젠 메이든", "로켓걸", "로쿠데나시 블루스", "로큐브!", "록맨 에그제 애니메이션 시리즈", "록맨 에그제", "록맨 에그제 Axess", "록맨 에그제 Stream", "록맨 에그제 Beast", "록맨 에그제 Beast+", "롤링☆걸즈", "롯테의 장난감!", "루가루", "루팡 3세", "류가죠 나나나의 매장금", "리라이프", "리루리루 페어리루: 요정의 문", "리루리루 페어리루: 마법의 거울", "리리카SOS", "리본의 기사", "리스토란테 파라디조", "리오 레인보우 게이트!", "리욘전설 프레아", "리코더와 책가방", "리틀 버스터즈!", "리틀 위치 아카데미아", "리틀프릿", "마경전설 아크로번치", "마계도시 〈신주쿠〉", "마계전기 디스가이아", "마기(만화)/애니메이션", "마기 신드바드의 모험", "마녀 배달부 키키", "마동왕 그랑조트", "마루 밑 아리에티", "마루코는 아홉살", "마리 & 갈리", "마리아님이 보고 계셔", "마리아 홀릭", "마멀레이드 보이", "마법과고교의 열등생", "마법기사 레이어스", "마법사라면 미소를 먹어라!", "마법사에게 소중한 것", "마법사의 딸", "마법사의 신부", "마법선생 네기마!", "마법소녀 따위는 이제 됐으니까.", "마법소녀 리리컬 나노하 시리즈", "마법소녀 마도카☆마기카", "마법소녀 메루루", "마법소녀 육성계획", "마법소녀 프리티 사미", "마법소녀 프리티☆벨", "마법소녀 티클", "마법소년 마죠리안", "마법을 쓰고 싶어!", "마법의 리본", "마법의 스타 매지컬 에미", "마법의 스테이지 팬시 라라", "마법의 아이돌 파스텔 유미", "마법의 천사 크리미마미", "마법의 프린세스 밍키모모", "마법전사 리우이", "마법전쟁", "마법진 구루구루 (전설의 마법 쿠루쿠루)", "마법총술사 쿠로히메", "마부라호", "마브러브 시리즈", "마시멜로 타임즈", "마소년 비티", "마사무네의 리벤지", "마술사 오펜", "마스터 키튼", "마시로이로심포니", "마신영웅전 와타루", "마오유우 마왕용자", "마왕 단테", "마요이가", "마요치키!", "마유비검첩", "마왕 JUVENILE REMIX", "마우스", "마음이 외치고 싶어해", "마이오토메", "마이히메 시리즈", "마이코 2010", "마인드 게임", "마인탐정 네우로", "마더 최후의 소녀 이브", "마작귀", "마작의 제왕 테츠야", "마즈", "마진 본", "마징가 시리즈", "마켄키", "마크로스 시리즈", "마탐정 로키", "마하 GoGoGo", "마호라바", "마호로매틱", "마탄의 왕과 바나디스", "만걸", "만안 미드나이트", "만월을 찾아서(달빛천사)", "만화가랑 어시스턴트랑", "만화로 배우는 심신의학", "만화 일본 옛날이야기", "망가지기 시작한 오르골", "망념의 잠드", "망량의 상자", "망량의 요람", "망상기행 Adolescene Avatar", "망상대리인", "맡겨줘! 미라클 캣단", "맡겨줘 이루카!", "매드불34", "매복병", "매지컬 스위트 프리즘 나나", "매지컬 타루루토", "맨발의 겐", "맵스", "맹렬 아타로", "맹렬 우주해적", "머나먼 시공 속에서 시리즈", "머더 프린세스", "머메이드 멜로디 피치피치핏치", "머신로보 크로노스의 대역습", "머신로보 레스큐", "머티리얼 퍼즐", "먹짱", "멋지다! 마사루", "멋지다 코니", "메가존 23", "메다카 박스", "메르", "메모리즈 오프", "메이플스토리", "메이저", "메이커 비공식 하츠네 믹스", "메조(애니메이션)", "메조포르테(애니메이션)", "메존일각", "메카쿠시티 액터즈", "메탈베이블레이드", "메탈 스킨 패닉 MADOX01", "메테오 메토세라", "명가의 술", "명왕계획 제오라이머", "명탐정 마니", "명탐정 코난", "모노가타리 시리즈 2nd Season", "모노노케", "모노노케 히메", "모든 것이 F가 된다", "모래시계", "모레의 방향", "모르모트의 시간", "모리타씨는 과묵", "모모네", "모모와 다락방의 수상한 요괴들", "모모이로 사바스", "모모쿠리", "모모큔 소드", "모브사이코 100", "모빌슈트 건담 디 오리진", "모시도라", "모야시몬", "모에가쿠★5", "모에땅", "모험유기 플러스터 월드", "모험왕 비트", "모험! 이쿠사3", "목소리로 일하자!", "목소리의 형태", "몬스터", "몬스터 아가씨가 있는 일상", "몬타나 존스", "몽전사 윙맨", "몽차원헌터 판도라", "몽환신사", "무민", "무사도 시리즈", "무사시 건도", "무시우타", "무인행성 서바이브", "무장신희", "무장연금", "무적강인 다이탄3", "무적로보 트라이더 G7", "무적뱅커 크로켓", "무적왕 트라이제논", "무적용사 사자왕", "무적 철가방", "무적초인 점보트3", "무적코털 보보보", "무적투혼 커프스", "무중력 소년", "무지개빛 데이즈", "무지갯빛 트로츠키", "무채한의 팬텀 월드", "무책임함장 테일러", "무카무카 파라다이스", "무한의 리바이어스", "무한의 주인", "무효와 로지의 마법률상담사무소", "문라이트 마일", "문제아들이 이세계에서 온다는 모양인데요?", "문차관내방기", "문호 스트레이 독스", "물가의 무로미 씨", "물에 빠진 나이프", "물의색 은의달", "므네모시네의 딸들", "미나미가", "미남고교 지구방위부 LOVE!", "미카구라 학원 조곡", "미녀는 괴로워", "미니스커트 우주해적", "미도리의 나날", "미드나이트 세크리터리", "미라클 걸즈", "미라클 소녀 리미트", "미라클 자이언츠 도무군", "미라클☆트레인", "미래로보 달타니어스", "미래소년 코난", "미래일기", "미르모 퐁퐁퐁", "미만 연애", "미소녀 전사 세일러 문", "미소의 세상", "미스터 아짓코", "미스터 지팡구", "미스터 초밥왕 - 미스터 초밥왕2", "미스터 풀스윙", "미스프리!", "미유키", "미즈이로", "미츠도모에", "미치코와 핫친", "미확인으로 진행형", "밀리터리!", "밀림의 왕자 레오", "바나나 피쉬", "바다가 들린다", "바다의 무녀", "바다이야기 ~당신이 있어 주었기에~", "바라카몬", "바람과 나무의 시", "바람계곡의 나우시카", "바람 속의 소녀 금발의 제니", "바람의 검심", "바람의 닌자", "바람의 마운드", "바람의 빛", "바람의 성흔(바람의 스티그마)", "바 레몬하트", "바론", "바보와 시험과 소환수", "바벨 2세", "바사라", "바스쿼시!", "바스타드", "바오 내방자", "바이스 크로이츠", "바이오하자드 댐네이션", "바이오하자드 디제네레이션", "바이올런스 잭", "바질리스크 코우가인법첩", "바카노!", "바쿠온!!", "바쿠간 배틀 브롤러즈", "바케모노가타리", "바쿠만", "바텐더", "박살천사 도쿠로", "박앵귀", "반드레드", "반딧불의 묘", "반딧불이의 숲으로", "반지의 기사", "밤의 얏타맨", "밤의 향기", "밝은 세계 계획", "방가방가 햄토리", "방과후 미드나이터즈", "방과 후 어드벤처", "방과 후의 카리스마", "방과후의 플레이아데스", "방과 후 플레이", "방랑소년", "배가본드", "배를 엮다", "배신자는 내 이름을 알고 있다", "배틀로얄", "백곰 카페", "백귀야행", "백마 탄 왕자님", "백사전", "백성귀족", "백설공주와 일곱명의 죄수", "백수왕 고라이온", "백작과 요정", "백작 카인 시리즈", "백화요란 사무라이 걸즈", "백화요란 전국오토메", "백희초", "뱀부 블레이드", "뱀파이어 기사", "뱀파이어 미유", "뱀파이어 번드", "뱀파이어 헌터", "뱀파이어 헌터 D", "버나드 양 가라사대.", "버키와 투투", "버블검 크라이시스", "벙개벙개", "벚꽃사중주", "벼랑 위의 포뇨", "변경경비", "변태왕자와 웃지 않는 고양이", "별나라 요정 코미", "별을 쫓는 아이", "별의 목소리", "별의 커비", "별하늘에 걸린 다리", "병속의 요정", "병아리 사랑", "베르사이유의 장미", "베르세르크: 황금시대 편", "베르세르크(新 시리즈)", "베리베리 뮤우뮤우", "베베데빌", "베이비 스텝", "베이비 프린세스", "베베데빌", "베터맨", "벡실 2077 일본쇄국", "벨제바브", "보석의 나라", "보노보노", "보이!", "보조개 왕자", "복수교실", "본좌 티처", "볼룸에 오신 것을 환영합니다", "봉신연의", "봉쥬르 사랑맛 파티스리", "부기팝은 웃지 않는다(부기팝 팬텀)", "부녀자랍니다", "부르잖아요", "아자젤씨", "부탁해! 마이멜로디", "북두의 권", "북으로", "분노의 늑대", "불꽃소년 레카", "불꽃의 미라주", "불꽃의 전학생", "불새", "불쾌한 모노노케안", "붓다", "붓다재림", "붉은 광탄 질리온", "붉은 돼지", "붉은등 애가", "뷰티풀 죠", "브레이브 스토리", "브레이크 블레이드", "브레이크 에이지", "브레인 파워드", "브리가둔 마린과 메란", "블랙 라군", "블랙 불릿", "블랙 블러드 브라더스", "블랙·잭", "블랙캣", "블러드 더 라스트 뱀파이어", "블러드 레드", "블러드C", "블러디 먼데이", "블레이드", "블레이드 앤 소울", "블레이블루 알터 메모리", "블루 드롭", "블루 젠더", "블리츠 로얄", "블리치", "비너스 버서스 바이러스", "비르투스", "비밀결사 매의발톱단", "비밀의 앗코짱", "비비드레드 오퍼레이션", "비색의 조각", "비치스타즈", "비탄의 아리아", "비터 버진", "빅토리 구슬동자", "빅쿠리 맨", "빅 오더", "빈곤자매 이야기", "빈란드 사가", "빌리 배트", "빙과", "빙쵸탄", "빛과 물의 다프네", "비디오전사 레자리온", "빠삐코", "빨간망토 차차", "빨강머리 백설공주", "빨강머리 앤", "뾰로롱 꼬마마녀", "쁘티프리 유시", "삐리리 불어봐 재규어", "사랑과 선거와 초콜릿", "사랑과 용기의 피그걸 톤데부링", "사랑한다고 말해", "사랑해 베이비", "사립 성 카틀레야 유치원", "사모님은 여고생", "사모님은 학생회장", "사무라이7", "사무라이 디퍼 쿄우", "사무라이 참프루", "사무라이 트루퍼", "사무라이 플라멩코", "사무라이건", "사비누키 그녀", "사사미양@노력하지않아", "사상최강의 제자 켄이치", "사스케", "사신에게 마지막 소원을", "사신의 발라드", "사실 나는", "사우르스 팡팡", "사이렌", "사이렌이 사는 바다", "사이버걸 마호로 (만화)", "사이버 모델 RINGO (만화)", "사이보그 009", "사이보그 할아버지 G쨩", "사이코 패스 (Psycho-Pass)", "사이코닥터 카이쿄오스케 (만화)", "사이코메트러 에지", "사이코아머 고바리안", "사이키 쿠스오의 재난", "사이킥 아카데미 (만화)", "사일런트 뫼비우스", "사자에상", "사춘기미소녀합체로보 지마인 (애니메이션)", "사츠키 콤플렉스", "사카모토입니다만?", "사키 -Saki-", "사키 아치가편", "사쿠라 대전", "사쿠라장의 애완 그녀", "사쿠라코 씨의 발밑에는 시체가 묻혀 있다", "사토라레", "사형집행중 탈옥진행중", "사화장사", "사후편지", "산카레아 (만화. 애니메이션)", "상남2인조", "삼자삼엽", "새벽녘보다 유리색인", "새벽의 연화", "새여동생 마왕의 계약자", "샐러드 데이즈", "생각하는 개 (만화)", "생존게임", "샤머닉 프린세스", "샤먼 시스터즈", "샤먼킹", "샤이닝 티어즈", "샤이닝 윈드", "샤이닝 하츠", "샹그리라", "서몬마스터즈 블루 드래곤", "서양골동양과자점 앤티크", "서번트×서비스", "석고 보이즈", "선계전 봉신연의", "선녀전설 세레스", "선생님", "선생님의 시간", "섬광의 나이트레이드", "섬란카구라", "섭씨 이과", "성검사의 금주영창", "성검의 블랙스미스", "성결정 알바트로스", "성 로잘린드", "성방무협 아웃로스타", "성 아랫마을의 단델리온", "성인 여성의 애니 타임", "성전", "성전사 단바인", "성흔의 퀘이사", "세기말 오컬트 학원", "세계귀", "세계에서 제일 강해지고 싶어!", "세계의 끝에서 사랑을 나눠요", "세계정복 ~모략의 즈베즈다~", "세계 제일의 첫사랑", "세 눈이 간다", "세례", "세븐 데이즈", "세이크리드 세븐", "세인트 비스트", "세인트 세이야", "세인트 세이야 Ω", "세인트 영멘", "세일러복과 중전차", "세키레이", "세토의 신부", "섹시가이", "센고쿠", "센과 치히로의 행방불명", "센코롤", "센토루의 고민", "센타로의 일기", "센티멘탈 져니", "셀프", "셜리", "셰프", "소녀는 언니를 사랑한다", "소녀왕국 표류기", "소녀요괴 자쿠로", "소녀 파이트", "소녀혁명 우테나", "소년 괴기 시리즈", "소년기사 라무", "NG기사 라무네&40", "VS기사 라무네&40염", "VS 기사 라무네&40 FRESH", "소년마법사", "소년 메이드 (만화)", "소년 음양사", "소년탐정 김전일", "소년 프린세스", "소년 하렘 (만화)", "소닉 X", "소닉 X 2기", "소드 가이[1]", "소드 아트 온라인", "소라의 날개", "소름", "소믈리에", "소믈리에르", "소울 이터", "소울 이터 NOT!", "소울 테이커", "너스위치 코무기짱 매지카르테", "소울드롭의 유체연구", "소프테니", "속삭임", "솔티레이", "쇼와 겐로쿠 라쿠고 심중", "쇼타선생 (만화)", "쇼트피스", "쇼킹! 도리루", "수라의 문", "수라의 각", "수병위인풍첩", "수병위인풍첩 용보옥편", "수수께끼 그녀 X", "수신 라이거", "수신연무", "수장기공 단쿠가 노바", "수퍼내추럴", "수호캐릭터", "수호캐릭터 앙코르", "수호천사 히마리", "순결의 마리아", "순백의 피오렌티나", "순정 드롭", "순정 로맨티카", "술 한잔 인생 한입", "슈가슈가룬", "슈발리에", "슈타인즈 게이트 (Steins;Gate)", "슈토헬", "슈팅 바쿠간", "슈퍼갤즈", "슈퍼닥터 K", "슈퍼로봇대전 OG", "슈퍼청춘브라더스", "수왕성", "스가이군과 가족석", "스나보우즈", "스마일 프리큐어!", "스모모모모모모 ~지상 최강의 신부~", "스미레 16세!!", "스바루", "스위치 걸", "스위트 프리큐어♪", "스즈미야 하루히의 우울", "스즈미야 하루히의 소실", "스즈미야 하루히 짱의 우울", "스즈카", "스즈키 선생님", "스카이 걸즈", "스카이 크롤러", "스카이 하이", "스카페이스", "스컬맨", "스케반 형사", "스케치북", "스켓", "스쿨데이즈", "스쿨럼블", "스크라이드", "스크랩드 프린세스", "스킵 비트", "스타뮤", "스타트", "스타쉽 오퍼레이터즈", "스톱!! 히바리군!", "스트라이크 더 블러드", "스트라이크 위치스", "스트라토스4", "스트레이트 재킷", "스트로베리 패닉", "스틸 볼 런", "스파이럴 추리의 띠", "스파이럴 얼라이브", "스파이시 핑크 (만화)", "스페셜 에이", "스페이스 댄디", "스프리건", "스피드 그래퍼", "슬램덩크", "슬랩 업 파티", "슬레이어즈", "슬레이어즈", "슬레이어즈 NEXT", "슬레이어즈 TRY", "슬레이어즈 Revolution", "슬레이어즈 Evolution-R", "시간을 달리는 소녀", "시간탐험대", "시공탐정 겐시군", "시구루이", "시귀", "시끌별 녀석들", "시도니아의 기사", "시로바코", "시리얼 익스페리먼츠 레인", "시마 과장", "시문", "시바견양", "시바토라", "시스터 프린세스", "시온의 왕", "시원찮은 그녀를 위한 육성방법", "시큐브", "시티헌터", "엔젤하트", "식극의 소마", "식령", "식령 제로", "신격의 바하무트 GENESIS", "신기동전기 건담 W", "신나는 과학 어드벤쳐 아하! 그렇구나", "신님X이몸X서방님!", "신 다!다!다!", "신만이 아는 세계", "신무월의 무녀", "신부 이야기", "신비의 세계 엘하자드", "신비한 마법 판판 파마시", "신비한 바다의 나디아", "신비한 별의 쌍둥이 공주", "신세계에서", "신세기 에반게리온", "신세기 GPX 사이버 포뮬러", "신시아 더 미션", "신의 물방울", "신의 인형", "신이 없는 일요일", "신장개업", "신조인간 캐산", "신 중화일미(요리왕 비룡)", "신체조", "신풍괴도 잔느", "신혼합체 고단나", "실낙원(만화)", "실종일기", "심령탐정 야쿠모", "심심한 칠드런", "심야식당", "십이국기", "싸우는 사서", "싸워라! 이쿠사1", "모험! 이쿠사3", "쌍둥이 맑음", "쌍성의 음양사", "썬더 일레븐", "썸머 워즈", "쓰르라미 울 적에", "쓰리몬 (미츠도모에)", "자살도", "자이언트 로보", "자이언트 로보 THE ANIMATION", "GR 자이언트 로보", "자이언트 킬링", "자폭군", "작안의 샤나", "작열의 탁구 소녀", "작은가슴의 두근거림", "작은 거인 마이크로맨", "작은 눈의 요정 슈가", "작은 아저씨", "잔잔한 내일로부터", "잔향의 테러", "잔혹한 신이 지배한다", "잘 나가는 두 사람", "잠자는 혹성", "잡동사니 거리의 스테인", "장갑기병 보톰즈", "장국의 알타이르", "장기짱 유키", "재와 환상의 그림갈", "저속령 DAYDREAM", "저", "트윈 테일이 됩니다", "적룡왕", "전국마신 고쇼군", "전국무쌍", "전국 바사라", "전국오토메", "전국컬렉션", "전뇌 코일", "전뇌모험기 웹다이버", "전략인간병기 카쿠고", "전력 소녀", "전설거신 이데온", "전설의 용자의 전설", "전설의 총사 아카즈킨", "전영소녀", "전용.", "전자상가의 서점 아가씨", "전장의 발큐리아", "전투메카 자붕글", "전투요정 유키카제", "전파교사", "전파녀와 청춘남", "전희절창 심포기어", "절대가련 칠드런", "절대 그이", "절대무적 라이징오", "절대미각 식탐정", "절대소년", "절대☆영역", "절원의 템페스트", "정글대제", "정글은 언제나 맑음 뒤 흐림", "하레구우", "정글의 왕자 타짱", "정들면 고향 코스모스장", "정령사의 검무", "정령의 수호자", "정의경찰 몬쥬", "제가페인", "제노사가 The 애니메이션", "제로의 사역마", "제멋대로인 녀석들", "제멋대로 카이조", "제복의 뱀피레스로드", "제비뽑기 언밸런스", "제트맨", "조이드 시리즈", "기수신세기 조이드", "조이드 신세기 슬래쉬 제로", "조이드 퓨저스", "조이드 제네시스", "조커 게임", "좀비론", "종말의 세라프", "종말의 이제타", "좋아해요!! 마법천사 코스모스", "좋은사람", "죄X10", "죄와 벌", "죠시라쿠", "죠죠의 기묘한 모험", "주가이", "주광의 스트레인", "주먹에 산다", "주먹 쥐고 손을 펴서", "주문은 토끼입니까?", "죽은 소녀를 위한 파반", "죽음이 두 사람을 갈라놓을 때까지", "중2병이라도 사랑이 하고 싶어!", "중전기 엘가임", "쥬 인법 마계전생", "쥬다스", "쥬로링 동물탐정 (아냐마루 탐정 키루민즈)", "쥬블스!", "쥬얼펫 시리즈", "지구로...", "지구방위가족", "지금", "거기에 있는 나", "지금 남편이 무슨 말을 하는 거지?", "지뢰진", "지뢰진 디아블로", "지상 최강의 남자 류", "지어스", "지옥갑자원", "지옥당 영계통신", "지옥별 레미나", "지옥선생 누베", "지옥소녀", "지옥프리", "지저스", "지켜줘! 롤리팝", "지팡구", "진격의 거인", "진격! 거인 중학교", "진베", "진 샤프트", "진심으로 날 사랑해라!!", "진 여신전생 데빌 칠드런 흑의 서·적의 서", "진월담 월희", "진키 시리즈", "질풍 아이언리거", "집 보는 에비츄", "집주인은 사춘기!", "짱켄맨", "쪽빛보다 푸르게", "쫑아는 사춘기", "차를 마시자", "차지맨 켄!", "창궁의 파프너 시리즈", "창룡전", "창성의 아쿠에리온", "아쿠에리온 EVOL", "창천의 권", "창천항로", "창해의 세기", "찾아보자! 부활동", "채운국 이야기", "척안의 소년", "천공의 성 라퓨타", "천공의 에스카플로네", "천공의 패자 Z", "천공전기 슈라토", "천공전사 젠키", "천녀전설 아야", "천년여우", "천방지축 덩크슛", "천사가 될거야", "천사금렵구", "천사소녀 네티", "천사의 꼬리", "천사의 알", "천사짱과 악마군", "천상천하", "천생연분", "천원돌파 그렌라간", "천재 바카본", "천재 유교수의 생활", "천지를 먹다", "천지무용", "천체전사 선레드", "천체의 메소드", "천하무적 크래쉬비드맨", "철냄비짱", "철만 (철권 만화)", "철완 버디", "철완 아톰", "철인 28호", "철콘 근크리트", "첫사랑 매지컬 블리츠", "첫사랑 몬스터", "첫사랑 한정", "청의 엑소시스트", "체인지 123", "체인 크로니클 ~하이케이타스의 빛~", "체포하겠어", "초기인 용호왕전기", "초대형 소녀", "초마신영웅전 와타루", "초속 5센티미터", "초수기신 단쿠가", "초역 백인일수 우타코이", "초원의 샬로트", "초월신력", "초음전사 보그맨", "초인 로크", "초인전대 바라타크", "초전자로보 콤바트라V", "초전자머신 볼테스 V", "초중신 그라비온", "초차원게임 넵튠 THE ANIMATION", "총몽", "총몽 라스트 오더", "최강로보 다이오쟈", "최강전설 쿠로사와", "최근 여동생의 상태가 조금 이상한 것 같다만", "최상의 명의", "최약무패의 신장기룡", "최유기", "최종병기 그녀(만화)", "쵸비츠", "추억의 마니", "축구왕 슛돌이", "축복의 캄파넬라", "추억은 방울방울", "충사", "출동! 119구조대", "취성의 가르간티아", "취작", "츠구모모", "츠리타마", "츠바사 크로니클", "츠키모노가타리", "치이는 조금 모자라", "치즈 스위트 홈", "치키타 GUGU", "치토세 겟츄!", "치하야후루", "친푸이", "침략! 오징어 소녀", "침묵의 함대", "칭송받는 자", "카나메모", "카노콘", "카니발(만화)", "카니발 판타즘", "카드캡터 사쿠라", "카드파이트!! 뱅가드", "KARA The Animation", "카레이도 스타", "카리아게군", "카린 증혈기", "카미야도리", "카미와자 완다", "카미츄!", "카사네", "카스민", "카우보이 비밥", "카이조", "카이트(애니메이션)", "카이트 리버레이터", "카케루", "카페 알파", "칸나기", "칸타렐라", "칼바니아 이야기", "칼 이야기", "캄피오네!", "캐럿", "캐릭캐릭 체인지", "캐산 Sins", "캔디 보이", "캔디캔디", "캠퍼", "캡틴 아리스", "캡틴 어스", "캡틴 츠바사", "캡틴 퓨쳐", "캣츠 아이", "커렉터 유이", "컬드셉트", "컬러풀", "컴파일러", "케로케로 차임", "케르베로스 사가", "케메코 디럭스!", "케이온!", "코게빵", "코드 기아스 반역의 를르슈", "코드 기아스 나이트메어 오브 나나리", "코드 기아스 망국의 아키토", "코드 기아스 반공의 스자쿠", "코드 기아스 쌍모의 오즈", "코드 기아스 칠흑의 렌야", "코모리 양은 거절하지 못해!", "코믹 마스터 J", "코멧 루시퍼", "코바토", "코세르테르의 용술사", "코이켄!", "코이히메", "코코로 도서관", "코쿠리코 언덕에서", "콘크리트 레볼루티오 초인환상", "콥스 파티", "코펠리온", "쿄소기가", "쿄시로와 영원의 하늘", "쿄시로 2030", "쾌걸 조로", "쾌걸 조로리", "쾌걸 증기탐정단", "쾌도천사 트윈엔젤", "쾌속 스피너", "쿠니미츠의 정치", "쿠단시", "쿠레나이", "쿠로가네", "쿠로코의 농구", "쿠로무쿠로", "쿠루네코", "쿠마미코", "쿠쿨칸", "쿵후보이 친미", "퀄리디아 코드", "퀸즈 블레이드", "퀸즈 블레이드 리벨리온", "큐티하니", "크게 휘두르며", "크라잉 프리맨", "크레용 신짱", "크로노 크루세이드", "크로스 게임", "크로스 앙쥬 천사와 용의 윤무", "크로우즈", "크롬 브레이커", "크림레몬", "클라나드", "클레이모어", "클로스 로드", "키노의 여행", "키 더 메탈 아이돌", "키디 그레이드", "키디 걸랜드", "키라라의 별", "키라링☆레볼루션", "키리키리정의 브라운 선생", "키리히토 찬가", "키문카무이", "키미키스 pure rouge", "키스덤", "키이타로 소년의 요괴 그림일기", "키즈나이버", "키테레츠 대백과", "킬라킬", "킬러씨", "킬 미 베이비", "킹덤", "키즈모노가타리", "타로", "타로 이야기", "타마유라", "타마코 마켓", "타마코 러브 스토리", "타이거 마스크", "타이의 대모험", "타이조 모테킹 사가", "타이타니아", "타임보칸 시리즈", "타임슬립 닥터 JIN", "타카미야 나스노입니다!", "타카야 -섬무학원격투전-", "타카하시 루미코 극장", "탐정 오페라 밀키 홈즈", "탐정의식", "탐정학원Q", "탐험 도리랜드", "탑블레이드(한일 합작)", "태권더 박", "태양의 기사 피코", "태양의 엄니 다그람", "태양의 왕자 호루스의 대모험", "태양의 집", "택틱스", "터치", "테니스의 왕자", "테라포마스", "테르마이 로마이", "테일즈 오브 디 어비스", "테일즈 오브 심포니아", "테크노라이즈", "테-큐!", "텐 - 텐호의 길을 걷는 쾌남아", "토가이누의 피", "토끼 드롭스", "토라도라!", "토리코", "토마의 심장", "토와노쿠온", "톱을 노려라!", "톱을 노려라2!", "투 러브 트러블", "트러블 다크니스", "투사 고디안", "투장 다이모스", "투하트", "투하트 ~Remember My Memories~", "투하트 2", "트라이건", "트라이건 맥시멈", "트라이브 쿨 크루", "트루 티어즈", "트리니티 블러드", "트리니티 세븐", "트윈 스피카", "트윈 시그널", "트리아지 X", "파괴마 사다미츠", "파괴수", "파군성전기", "파니포니 대쉬", "파렴치 학원", "파브르 선생은 명탐정", "파사대성 단가이오", "파사거성 G 단가이오", "파스텔", "파워퍼프걸Z", "파이널 판타지 언리미티드", "파이널 판타지 7 어드벤트 칠드런", "파이-브레인 신의 퍼즐", "파이브 스타 스토리", "파이트다!!퓨타", "파이트일발! 충전쨩!!", "파인애플 아미", "파워", "파자마 한 그녀", "파타리로", "파프리카", "파천황유희", "판도라 하츠", "판타스틱 칠드런", "판타지스타 돌", "팔견전-동방팔견이문-", "팥경단과 찹쌀떡 (만화)", "패밀리 컴포", "패왕대계 류나이트", "팬텀 프린세스 버서스", "팬티 & 스타킹 with 가터벨트", "퍼펙트 블루", "펀치라인", "펌프킨 시저스", "평범한 여고생이 지역 아이돌을 해 보았다", "페르소나 4 the ANIMATION", "페르소나 4 the Golden ANIMATION", "페르소나 트리니티 소울", "페어리 테일", "페이퍼 브레이버", "페케", "펫숍 오브 호러즈", "신 펫숍 오브 호러즈", "펭귄 브라더스(만화)", "편의점 DMZ", "포기하지마", "포요포요 관찰일기", "포의 일족", "포켓몬스터 애니메이션 시리즈", "포켓몬스터(애니메이션)", "포켓몬스터 AG", "포켓몬스터 DP", "포켓몬스터 베스트위시", "포켓몬스터 XY(애니메이션)", "포켓몬스터 전격피카츄", "포켓몬스터 PiPiPi 어드벤쳐", "포켓몬스터 ReBURST", "포켓몬스터 SPECIAL", "포테마요", "포토카노", "포톤", "포코냥", "포피 더 파포머", "폭두고딩 타나카", "폭렬 갑자원", "폭렬 에토레인저", "폭렬천사", "폭렬헌터", "폭소 발명왕", "폭음열도", "폭주형제 렛츠&고", "폭풍우 치는 밤에", "폭 TECH! 바쿠간", "폼포코 너구리 대작전", "표류교실", "푸규루", "푸른 강철의 아르페지오", "푸른 꽃", "푸른 문학 시리즈", "푸른 바다의 아이온", "푸른 유성 SPT 레이즈너", "푸른 저편의 포리듬", "푸치마스!", "풀 메탈 패닉", "풍마의 코지로", "퓨파", "프라나스 걸", "프라모 쿄시로", "프랑켄 프랑", "프랙탈", "프레쉬 프리큐어!", "프로젝트 A코", "프론트 미션 도그라이프 앤드 도그스타일", "프리덤", "프리즘 아크", "프리징", "프리큐어 시리즈", "프리큐어 올스타즈 DX", "프리크리", "프리티 리듬 시리즈", "프리티 리듬 오로라 드림", "프리티 리듬 디어 마이 퓨처", "프리파라", "프리티 리듬 레인보우라이브", "프리티 페이스", "프린세스 나인", "프린세스 츄츄", "프린세스 프린세스", "프린스 오브 스트라이드", "플라네테스", "플라스틱 메모리즈", "플라스틱 언니", "플라워 오브 라이프", "플라이 하이", "플라잉 위치", "플래그", "플랜더스의 개", "플리즈 티쳐", "플리즈 트윈즈", "플립 플래퍼즈", "피구왕 통키", "피규어17 츠바사&히카루", "피스메이커 쿠로가네", "피아노(애니메이션)", "피아노의 숲", "피치피치핏치", "피타텐", "핑퐁", "하나다 소년사", "하나마루 유치원", "하나씨의 간단요리", "하나야마타", "하나우쿄 메이드대", "하나우쿄 메이드대 La Verite", "하느님의 메모장", "하늘 가는대로", "하늘은 붉은 강가", "하늘이 잿빛이라서", "하늘의 소리", "하늘의 유실물", "하늘의 혈맥", "하레구우", "하루미네이션", "하루와 나츠", "하루치카 하루타와 치카는 청춘이다", "하마토라", "하멜의 바이올린", "하야테x블레이드", "하야테처럼!", "하운티드 정션", "하울의 움직이는 성", "하이바네 연맹", "하이스쿨 D×D", "하이스쿨 기면조", "하이스코어 걸", "하이큐!!", "하이 스쿨 플릿", "하쿠보의 크로니클", "하트나라의 앨리스", "하트 캐치 프리큐어!", "하트 커넥트", "하품요정 아쿠비", "학교괴담", "학교생활!", "학교 선생님", "학생회 임원들", "학원묵시록 HIGHSCHOOL OF THE DEAD", "학원 베이비시터즈", "학원 앨리스", "학원 유토피아 마나비 스트레이트!", "한방! 소년", "한츠X트래쉬", "함대 컬렉션", "합신전대 메칸더 로보", "항설백물어", "할머니는 아이돌", "할아버지와 함께", "할아버지는 소년탐정", "해파리 공주", "해피☆레슨", "해황기", "핸드 셰이커", "행복 그래피티", "행복한 세상의 족제비", "행복카페 3번가", "햣코", "허니문 샐러드", "허니와 클로버", "허니커밍", "허니컴", "허리케인 포리마", "헌터×헌터", "헛쯔모없는 개혁", "헤키요 고교 학생회 의사록 = 학생회의 일존", "헤븐즈 런너 아키라", "헤타리아", "헨제미", "헬렌esp", "헬로우 블랙잭", "헬싱", "헬터 스켈터", "혁명기 발브레이브", "혁명의 날", "현란무답제", "현시연", "혈계전선", "혐한류", "협박 DOG'S", "형무소안에서", "호리 씨와 미야무라 군", "호문쿨루스", "호에로 펜", "호우오학교 미소년반", "호오즈키의 냉철", "호즈키 가의 누님", "호타루의 빛", "호호 아줌마", "혹성로보 단가드A", "혼약협정", "홀리랜드", "홍각의 판도라", "화관의 마돈나", "화려한 식탁", "환상게임", "환상수호전3 ~운명의 계승자~", "환상수호전5 ~여명의 성~", "환영박람회", "환영을 달리는 태양", "황금박쥐", "황금전사 골드라이탄", "황야의 증기소녀", "황야에 짐승 통곡하다", "황혼소녀×암네지아", "회장님은 메이드 사마!", "효게모노", "후르츠 바스켓", "후우카", "후타리 H", "후타코이", "후타코이 얼터너티브", "후세 말하지 못한 내 사랑", "흐린 하늘 프리즘 솔라카", "흑마녀 나가신다!", "흑신", "흑집사", "흑철", "흡혈희 미유", "히다마리 스케치", "히라히라고교 궁도부", "히로익 에이지", "히메고토", "히미코전", "히카루의 바둑", "히토히라", "히트가이 J", "힘내라! 킥커즈", "07-GHOST", "1파운드의 복음", "1학년이 되어버린다면", "11인이 있다!", "11eyes", "12인의 상냥한 암살자", "1318의 몽정기", "13일은 금요일?", "14세", "203호의 진코씨", "3월의 라이온", "3X3 EYES", "30세의 보건체육", "4년생", "4월은 너의 거짓말", "4차원 탐정 똘비", "5년생", "666 사탄", "7센티! -또 하나의 세계-", "7인의 나나", "7인의 셰익스피어", "7SEEDS", "91Days"];
var name2 = new Array();

var player = [["유령",-1,0,0,-1,0,0]];
var s1 = null, s2 = null;
const Jsoup = org.jsoup.Jsoup;
const Document = org.jsoup.nodes.Document;
const Element = org.jsoup.nodes.Element;
const Elements = org.jsoup.select.Elements;

//https://api.hearthstonejson.com/v1/62331/koKR/cards.collectible.json
//https://hearthstonejson.com/docs/cards.html 에서 하스스톤 카드 api 찾음.
function parse(url){
	var i, ii;
	var str = "";
	try{
		var table = Jsoup.connect(url).execute().parse().body().getElementsByClass("wiki-heading-content");
		for(i = 2; i < table.size(); i ++){
			if(table.get(i).getElementsByClass("wiki-table-wrap").size() > 0){
				var cards = table.get(i).getElementsByClass("wiki-table-wrap").get(0).child(0).child(0).children();
				for(ii = 1; ii < cards.size(); ii ++){
					var card = cards.get(ii);
					if(card.children().size() != 4) continue;
					str+="체크대상 "+card.child(1).child(0).ownText()+" 은 숫자다 "+(!isNaN(card.child(1).child(0).ownText()))+"\n";
					if(isNaN(card.child(1).child(0).ownText())) continue;
					var arr = new Array();
					arr.push(card.child(0).child(0).child(0).ownText());
					arr.push(card.child(1).child(0).ownText());
					arr.push(card.child(2).child(0).ownText());
					arr.push(card.child(3).child(0).ownText());
					name2.push(arr);
				}
			}
		}
	}catch(e){
		Log.e(str+"\n"+i+"번째, "+ii+"번째에서 오류");
	}
}

parse("https://namu.wiki/w/%ED%95%98%EC%8A%A4%EC%8A%A4%ED%86%A4/%EC%A7%81%EC%97%85%20%EC%A0%84%EC%9A%A9%20%EC%B9%B4%EB%93%9C");
parse("https://namu.wiki/w/%ED%95%98%EC%8A%A4%EC%8A%A4%ED%86%A4/%EA%B3%B5%EC%9A%A9%20%EC%B9%B4%EB%93%9C");

var sdcard = android.os.Environment.getExternalStorageDirectory().getAbsolutePath();
var txt = readFile(sdcard+"/퀴즈.txt");

function talkReceivedHook(room, message, sender, isGroup) {
if(isGroup && sender != "광고" && sender != "너차단"){
if(message == "/help"){
KakaoTalk.send(room, "자음퀴즈 ver 1.0\n\"/하스카드퀴즈\" or \"애니제목퀴즈\"\n버그개많음");
}
var s = indexOf(sender, 0);
if((message == "/하스카드퀴즈" || message == "/애니제목퀴즈") && s == -1){
KakaoTalk.send(room, "새로운 플레이어가 인식되었습니다.\n환영합니다, "+sender+"님.");
var arr = [sender, -1, 0, 0, -1, 0, 0];
player.push(arr);
//이름, 애니, 기회, 애니총합, 하스, 기회, 하스총합
} else{

if(player[s][1] != -1){
if(message == name1[player[s][1]]){
player[s][1] = -1;
player[s][2] = 0;
player[s][3] ++;
KakaoTalk.send(room, "정답!! 현재 점수 : "+player[s][3]+"점");
} else{
player[s][2] --;
if(player[s][2] != 0){
KakaoTalk.send(room, "오답!\n"+sender+"님의 문제입니다.\n"+cho_hangul(name1[player[s][1]])+"\n남은기회 : "+player[s][2]+"번");
} else{
if(player[s][3] > 0)player[s][3]--;
KakaoTalk.send(room, "오답!\n정답은 "+name1[player[s][1]]+"이었습니다!\n현재 애니제목퀴즈 점수 : "+player[s][3]);
/*
var str = "상세 내역\n"+name1[player[s][1]]+"\n"+message+"\n";
for(var i=0; i<name1[player[s][1]].length; i++){
str += name1[player[s][1]].charCodeAt(i)+"\n";
str += message.charCodeAt(i)+"\n";
} KakaoTalk.send(room, str);*/
player[s][1] = -1;
}

}
}





else if(player[s][4] != -1){
if(message == name2[player[s][4]][0]){
player[s][4] = -1;
player[s][5] = 0;
player[s][6] ++;
KakaoTalk.send(room, "정답!! 현재 점수 : "+player[s][6]+"점");
} else{
player[s][5] --;
if(player[s][5] != 0){
KakaoTalk.send(room, "오답!\n"+sender+"님의 문제입니다.\n이름 : "+cho_hangul(name2[player[s][4]][0])+"\n"+name2[player[s][4]][1]+"코스트 "+name2[player[s][4]][2]+" "+name2[player[s][4]][3]+"카드\n남은기회 : "+player[s][5]+"번");
} else{
if(player[s][6] > 0)player[s][6]--;
KakaoTalk.send(room, "오답!\n정답은 "+name2[player[s][4]][0]+"이었습니다!\n현재 하스뒷면퀴즈 점수 :  "+player[s][6]);
/*

var str = "";
for(var i=0; i<name2[player[s][4]][0].length; i++){
str += name2[player[s][4]][0].charCodeAt(i)+"\n";
str += message.charCodeAt(i)+"\n";
} KakaoTalk.send(room, str);*/
player[s][4] = -1;
}

}
}


 else{
  if(message == "/애니제목퀴즈") {
var s1 = Math.floor(Math.random() * name1.length);
   KakaoTalk.send(room, sender+"님의 문제입니다.\n"+cho_hangul(name1[s1])+"\n남은기회 : 3번");
player[s][1] = s1;
player[s][2] = 3;
  }
else if(message == "/하스카드퀴즈"){
var s2 = Math.floor(Math.random() * name2.length);
KakaoTalk.send(room, sender+"님의 문제입니다.\n이름 : "+cho_hangul(name2[s2][0])+"\n"+name2[s2][1]+"코스트 "+name2[s2][2]+" "+name2[s2][3]+"카드\n남은기회 : 3번");
player[s][4] = s2;
player[s][5] = 3;
} else{

}
}
}






    if(message == "/랭킹" || message == "/순위"){
   // if(player.length > 9){

      var rank = new Array();
      for(var i in player) rank.push(player[i][3]+player[i][6]);
    var arr = ranking(rank,true);
for(var i=arr.length; i>0; i--){
while(arr.indexOf(i) != lastIndexOf(arr,i)){ arr[arr.indexOf(i)] --;

}
}

saveFile(sdcard+"/실험용.txt",arr.join(", "),false);
   var str = "";
for(var i=1; i<player.length+1; i++){
   str += (i+"위 : "+player[arr.indexOf(i)][0]+" : +"+player[arr.indexOf(i)][3]+" + "+player[arr.indexOf(i)][6]+" = "+(player[arr.indexOf(i)][3]+player[arr.indexOf(i)][6]));
   if(i != 10) str += "\n";
}
KakaoTalk.send(room, str);
  
 /*   }else {
    KakaoTalk.send(room, "순위를 매기기에 인원이 충분하지 않습니다. 필요인원 : 10명");*/
    }

}
}



function ranking(array,rev){
var arr=new Array();
var temp=new Array();
var result=new Array();
for(var i in array)arr.push(parseInt(array[i]) + 10000);
for(var i in arr)temp.push(arr[i]);
arr.sort();
for(var i in arr)result.push(arr.indexOf(temp[i])+1);
if(rev)for(var i in result)result[i]=Math.abs(result[i]-result.length-1);
return result;
}
function lastIndexOf(arr,num){
for(var i=arr.length-1;i>-1;i--) if(arr[i] == num) return i;
return -1;
}
function cho_hangul(str) {
  var cho = ["ㄱ","ㄲ","ㄴ","ㄷ","ㄸ","ㄹ","ㅁ","ㅂ","ㅃ","ㅅ","ㅆ","ㅇ","ㅈ","ㅉ","ㅊ","ㅋ","ㅌ","ㅍ","ㅎ"];
  var result = "";
  for(i=0;i<str.length;i++) {
    code = str.charCodeAt(i)-44032;
    if(code>-1 && code<11172) result += cho[Math.floor(code/588)];
else result += str[i];
  }
  return result;
}
function indexOf(str, num){
   if(num >= player[0].length) return -1;
   for(var i in player){
      if(player[i][num]+"" == str+"") return i;
   }
   return -1;
}




var txt = readFile(sdcard+"/퀴즈.txt");
if(txt != null){
var arr = txt.split("\n"); //플레이어 단위로 나눔
for(var i in arr){
   var info = arr[i].split(",");
   var array = new Array();
   for(var ii in info){
      if(ii == 0)   array.push(info[ii]);
      else array.push(parseInt(info[ii]));
   }
   player.push(array);
}
saveFile(sdcard+"/log.txt","[퀴즈] ["+getTime("G yyyy년 MM월 dd일 aa hh:mm:ss(E)")+"] LOG : 불러오기 완료\n",true);
saveFile(sdcard+"/퀴즈.txt.backup",txt,false);
}else saveFile(sdcard+"/log.txt","[퀴즈] ["+getTime("G yyyy년 MM월 dd일 aa hh:mm:ss(E)")+"] LOG : 처음부터 기록\n",true);




function readFile(path) {
try {
var file = new java.io.File(path);
if(!(file.exists())) return null;
var fis = new java.io.FileInputStream(file);
var isr = new java.io.InputStreamReader(fis);
var br = new java.io.BufferedReader(isr);
var s = br.readLine();
var read = "";
while((read = br.readLine()) != null) s += "\n" + read;
fis.close();
isr.close();
br.close();
return s;
}catch(error) {

}
}

function saveFile(path,content,bool){
try{
var file = new java.io.File(path);
if(!file.exists()){ makeFile(path);
file = new java.io.File(path);}
var fw = new java.io.FileWriter(file,bool);
var bw = new java.io.BufferedWriter(fw);
var str = new java.lang.String(content);
bw.write(str);
bw.close();
fw.close();
}catch(e){
}}

function makeFile(path){
try{
var file = new java.io.File(path);
if(file.createNewFile()){

}
else{}
}catch(e){
clientMessage(e);}}

function makeFolder(path){
try{
var file = new java.io.File(path);
if(!file.exists()){
file.mkdir();
}
else{}
}catch(e){
clientMessage(e);}}

function makeTXT(){
txt = "";
for(var i in player){
   for(var ii in player[i]){

if(ii == player[i].length - 1) txt += player[i][ii];
else txt += player[i][ii]+",";
   }
   if(i != player.length - 1) txt += "\n";
}
if(readFile(sdcard+"/퀴즈.txt") == null || readFile(sdcard+"/퀴즈.txt").split("\n").length<=txt.split("\n").length){
saveFile(sdcard+"/퀴즈.txt",txt,false);

saveFile(sdcard+"/log.txt","[퀴즈] ["+getTime("G yyyy년 MM월 dd일 aa hh:mm:ss(E)")+"] LOG : 저장완료\n",true);
}
}

//new java.lang.Thread(run:function(){
new java.lang.Thread(new java.lang.Runnable({run:function(){
try{
while(true){
java.lang.Thread.sleep(60000);
makeTXT();
}
}catch(e){saveFile(sdcard+"/log.txt","["+getTime("[퀴즈] G yyyy년 MM월 dd일 aa hh:mm:ss(E)")+"] LOG : "+e+"\n");}
}})).start();

function getTime(format){
format=new java.text.SimpleDateFormat(format);
var cal=java.util.Calendar.getInstance();
return format.format(cal.getTime());
}
